# etl1c-07  |["ア","イ","ウ","エ","オ","カ","キ","ク",
# etl1c-08  | "ケ","コ","サ","シ","ス","セ","ソ","タ",
# etl1c-09  | "チ","ツ","テ","ト","ナ","ニ","ヌ","ネ",
# etl1c-10  | "ノ","ハ","ヒ","フ","ヘ","ホ","マ","ミ",
# etl1c-11  | "ム","メ","モ","ヤ","イ","ユ","エ","ヨ",
# etl1c-12  | "ラ","リ","ル","レ","ロ","ワ","ヰ","ウ",
# etl1c-13  | "ヱ","ヲ","ン"]
#
# etl1c-07  | ["ア","イ", "イ", "ウ", "ウ", "エ", "エ", "オ","カ","キ","ク","
# etl1c-08  | "ケ","コ","サ","シ","ス","セ","ソ","タ",
# etl1c-09  | "チ","ツ","テ","ト","ナ","ニ","ヌ","ネ",
# etl1c-10  | "ノ","ハ","ヒ","フ","ヘ","ホ","マ","ミ",
# etl1c-11  | "ム","メ","モ","ヤ",   ,"ユ",  ,"ヨ",
# etl1c-12  | "ラ","リ","ル","レ","ロ","ワ","ヰ",   ,
# etl1c-13  | "ヱ","ヲ","ン"]

# イ, ウ, and エ have a duplicate set of data each within the ETL1 dataset
# ETL1_katakana = [
#     "ア", "イ", "ウ", "エ", "オ", "カ", "キ", "ク",
#     "ケ", "コ", "サ", "シ", "ス", "セ", "ソ", "タ",
#     "チ", "ツ", "テ", "ト", "ナ", "ニ", "ヌ", "ネ",
#     "ノ", "ハ", "ヒ", "フ", "ヘ", "ホ", "マ", "ミ",
#     "ム", "メ", "モ", "ヤ", "イ", "ユ", "エ", "ヨ",
#     "ラ", "リ", "ル", "レ", "ロ", "ワ", "ヰ", "ウ",
#     "ヱ", "ヲ", "ン"
# ]
ETL1_katakana = [
    "ｱ", "ｲ", "ｳ", "ｴ", "ｵ",	"ｶ", "ｷ", "ｸ",
    "ｹ", "ｺ", "ｻ", "ｼ", "ｽ", "ｾ", "ｿ", "ﾀ",
    "ﾁ", "ﾂ", "ﾃ", "ﾄ",	"ﾅ", "ﾆ", "ﾇ", "ﾈ",
    "ﾉ", "ﾊ", "ﾋ", "ﾌ", "ﾍ",	"ﾎ", "ﾏ", "ﾐ",
    "ﾑ", "ﾒ", "ﾓ", "ﾔ", "ｲ",	"ﾕ", "ｴ", "ﾖ",
    "ﾗ", "ﾘ", "ﾙ", "ﾚ", "ﾛ", "ﾜ", "ｳ", "ｦ", "ﾝ"
]
# katakana_literals = [
#     "ア", "イ", "ウ", "エ", "オ",
#     "カ", "キ", "ク", "ケ", "コ",
#     "サ", "シ", "ス", "セ", "ソ",
#     "タ", "チ", "ツ", "テ", "ト",
#     "ナ", "ニ", "ヌ", "ネ", "ノ",
#     "ハ", "ヒ", "フ", "ヘ", "ホ",
#     "マ", "ミ", "ム", "メ", "モ",
#     "ヤ", "ユ", "ヨ", "ラ", "リ",
#     "ル", "レ", "ロ", "ワ", "ヰ",
#     "ヱ", "ヲ", "ン"
# ]
katakana_literals = [
    "ｱ", "ｲ", "ｳ", "ｴ", "ｵ",
    "ｶ", "ｷ", "ｸ", "ｹ", "ｺ",
    "ｻ", "ｼ", "ｽ", "ｾ", "ｿ",
    "ﾀ", "ﾁ", "ﾂ", "ﾃ", "ﾄ",
    "ﾅ", "ﾆ", "ﾇ", "ﾈ", "ﾉ",
    "ﾊ", "ﾋ", "ﾌ", "ﾍ", "ﾎ",
    "ﾏ", "ﾐ", "ﾑ", "ﾒ", "ﾓ",
    "ﾔ", "ﾕ", "ﾖ", "ﾗ", "ﾘ",
    "ﾙ", "ﾚ", "ﾛ", "ﾜ", "ｦ",
    "ﾝ"
]
romanji = [
    "WO", "A", "I", "U", "E", "O",
    "KA", "KI", "KU", "KE", "KO",
    "SA", "SI", "SU", "SE", "SO",
    "TA", "TI", "TU", "TE", "TO",
    "NA", "NI", "NU", "NE", "NO",
    "HA", "HI", "HU", "HE", "HO",
    "MA", "MI", "MU", "ME", "MO",
    "YA", "YU", "YO", "RA", "RI",
    "RU", "RE", "RO", "WA", "N"
]

romanji_to_katakana = dict(zip(romanji, katakana_literals))
katakana_to_romanji = dict(zip(katakana_literals, romanji))
romanji_to_class = dict(zip(romanji, range(len(romanji))))

# for x in

katakana_to_class = dict(zip(romanji, range(len(romanji))))

